In [32]:
import pandas as pd
from io import StringIO

str_employees = '''| employee_id | name      | department            | salary |
| ----------- | --------- | --------------------- | ------ |
| 3           | Bob       | Operations            | 48675  |
| 90          | Alice     | Sales                 | 11096  |
| 9           | Tatiana   | Engineering           | 33805  |
| 60          | Annabelle | InformationTechnology | 37678  |
| 49          | Jonathan  | HumanResources        | 23793  |
| 43          | Khaled    | Administration        | 40454  |
'''
n_lines = 3
line_width = 0
for n in range(len(str_employees)):
    if str_employees[n] == '\n':
        break
    else:
        line_width += 1
str_employees = str_employees[:(n_lines + 2) * line_width + 1]
str_employees = '\n'.join([row for row in str_employees.split('\n') if '---' not in row])
employees = pd.read_csv(StringIO(str_employees), sep='|').dropna(axis='columns')

def selectFirstRows(employees: pd.DataFrame) -> pd.DataFrame:
    return employees.head(3)

selectFirstRows(employees)

   employee_id    name         department              salary
0             3   Bob          Operations                48675
1            90   Alice        Sales                     11096
2             9   Tatiana      Engineering               33805

60
60
60
60
60
60
60